diffusionFvOptions/testCases/reactingFoam_mixing/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.005; // 1e-6;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no; // yes;

maxCo           0.4;

maxDeltaT       1;

libs ("libdiffusionFvOptions.so");

functions
{
    writeObjects
    {
        type            writeObjects;
        libs            ("libutilityFunctionObjects.so");

        objects         (rho h);

        writeControl    writeTime;
    }

    energyInletAir
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        writeTotalArea  no;
        writeFields     no;
        regionType      patch;
        name            inletAir;
        operation       weightedSum;
        weightField     phi;
        fields
        (
            h
        );
    }

    energyInletFuel
    {
        $energyInletAir;
        name inletFuel;
    }

    energyOutlet
    {
        $energyInletAir;
        name outlet;
    }

    massInletAir
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        writeTotalArea  no;
        writeFields     no;
        regionType      patch;
        name            inletAir;
        operation       sum;
        fields
        (
            phi
        );
    }

    massInletFuel
    {
        $massInletAir;
        name inletFuel;
    }

    massOutlet
    {
        $massInletAir;
        name outlet;
    }
}

// ************************************************************************* //
